Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.Curve Property
 Gets or sets the geometric Contour of the rebar modifier.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Contour Curve { get; set; }
Public Property Curve As Contour
	Get
	Set
Property Value
Type: Contour
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace